cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
brew 'mas'

brew 'mr'
brew 'vcsh'

brew 'ack'
brew 'ansible'
brew 'azure-cli'
brew 'cask'
brew 'ccache'
brew 'cmake'
brew 'coreutils'
brew 'emacs', args: ['with-cocoa']
brew 'git'
brew 'gnupg2'
brew 'gnu-sed', args: ['with-default-names']
brew 'htop'
brew 'ispell'
brew 'jq'
brew 'kpcli'
brew 'llvm'
brew 'openssh'
brew 'python'
brew 'shellcheck'
brew 'terraform'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

cask 'xquartz'

cask 'amethyst'
cask 'google-chrome'
cask 'docker'
cask 'dropbox'
cask 'inkscape'
cask 'insync'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java'
cask 'keepassx'
cask 'slack'
cask 'spectacle'
cask 'ubar'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'

mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
